riversnails/ti-aoa/projects/v5_rtls_passive_CC26X2R1_LAUNCHXL_tirtos_ccs/Release/configPkg/package/cfg/rtls_passive_app_pem4f.c
#define ti_sysbios_knl_Swi_numPriorities__C (ROM_constStruct.ti_sysbios_knl_Swi_numPriorities__R)
#define ti_sysbios_knl_Task_numConstructedTasks__C (ROM_constStruct.ti_sysbios_knl_Task_numConstructedTasks__R)
#define xdc_runtime_Startup_maxPasses__C (ROM_constStruct.xdc_runtime_Startup_maxPasses__R)
#define ti_sysbios_knl_Task_initStackFlag__C (ROM_constStruct.ti_sysbios_knl_Task_initStackFlag__R)
#define xdc_runtime_System_abortFxn__C (ROM_constStruct.xdc_runtime_System_abortFxn__R)
#define ti_sysbios_knl_Mailbox_Instance_State_dataSem__O (ROM_constStruct.ti_sysbios_knl_Mailbox_Instance_State_dataSem__O)
#define ti_sysbios_gates_GateHwi_Module__FXNS__C (ROM_constStruct.ti_sysbios_gates_GateHwi_Module__FXNS__R)
#define ti_sysbios_hal_Hwi_Object__DESC__C (ROM_constStruct.ti_sysbios_hal_Hwi_Object__DESC__R)
#define ti_sysbios_family_arm_m3_Hwi_priGroup__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_priGroup__R)
#define xdc_runtime_Error_E_memory__C (ROM_constStruct.xdc_runtime_Error_E_memory__R)
#define ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__R)
#define ti_sysbios_knl_Mailbox_Instance_State_freeSem__O (ROM_constStruct.ti_sysbios_knl_Mailbox_Instance_State_freeSem__O)
#define ti_sysbios_knl_Queue_Object__table__C (ROM_constStruct.ti_sysbios_knl_Queue_Object__table__R)
#define ti_sysbios_knl_Semaphore_eventPost__C (ROM_constStruct.ti_sysbios_knl_Semaphore_eventPost__R)
#define xdc_runtime_System_exitFxn__C (ROM_constStruct.xdc_runtime_System_exitFxn__R)
#define ti_sysbios_heaps_HeapTrack_A_doubleFree__C (ROM_constStruct.ti_sysbios_heaps_HeapTrack_A_doubleFree__R)
#define ti_sysbios_heaps_HeapMem_reqAlign__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_reqAlign__R)
#define xdc_runtime_Startup_sfxnRts__C (ROM_constStruct.xdc_runtime_Startup_sfxnRts__R)
#define ti_sysbios_knl_Semaphore_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Semaphore_Object__DESC__R)
#define ti_sysbios_gates_GateHwi_Object__DESC__C (ROM_constStruct.ti_sysbios_gates_GateHwi_Object__DESC__R)
#define xdc_runtime_SysCallback_putchFxn__C (ROM_constStruct.xdc_runtime_SysCallback_putchFxn__R)
#define ti_sysbios_heaps_HeapMem_Object__count__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_Object__count__R)
#define ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__R)
#define ti_sysbios_knl_Mailbox_maxTypeAlign__C (ROM_constStruct.ti_sysbios_knl_Mailbox_maxTypeAlign__R)
#define ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__C (ROM_constStruct.ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__R)
#define ti_sysbios_knl_Event_Instance_State_pendQ__O (ROM_constStruct.ti_sysbios_knl_Event_Instance_State_pendQ__O)
#define ti_sysbios_knl_Task_allBlockedFunc__C (ROM_constStruct.ti_sysbios_knl_Task_allBlockedFunc__R)
#define ti_sysbios_family_arm_m3_Hwi_E_hardFault__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_hardFault__R)
#define ti_sysbios_knl_Mailbox_Object__count__C (ROM_constStruct.ti_sysbios_knl_Mailbox_Object__count__R)
#define xdc_runtime_Text_nameStatic__C (ROM_constStruct.xdc_runtime_Text_nameStatic__R)
#define ti_sysbios_family_arm_m3_Hwi_E_debugMon__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_debugMon__R)
#define ti_sysbios_family_arm_m3_Hwi_E_svCall__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_svCall__R)
#define ti_sysbios_knl_Clock_Module_State_clockQ__O (ROM_constStruct.ti_sysbios_knl_Clock_Module_State_clockQ__O)
#define xdc_runtime_SysCallback_readyFxn__C (ROM_constStruct.xdc_runtime_SysCallback_readyFxn__R)
#define xdc_runtime_Text_unnamedModsLastId__C (ROM_constStruct.xdc_runtime_Text_unnamedModsLastId__R)
#define ti_sysbios_knl_Task_defaultStackSize__C (ROM_constStruct.ti_sysbios_knl_Task_defaultStackSize__R)
#define xdc_runtime_IGateProvider_Interface__BASE__C (ROM_constStruct.xdc_runtime_IGateProvider_Interface__BASE__R)
#define ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__R)
#define xdc_runtime_Startup_startModsFxn__C (ROM_constStruct.xdc_runtime_Startup_startModsFxn__R)
#define ti_sysbios_knl_Semaphore_Instance_State_pendQ__O (ROM_constStruct.ti_sysbios_knl_Semaphore_Instance_State_pendQ__O)
#define xdc_runtime_System_extendFxn__C (ROM_constStruct.xdc_runtime_System_extendFxn__R)
#define ti_sysbios_family_arm_m3_Hwi_Object__DESC__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_Object__DESC__R)
#define xdc_runtime_Text_nameEmpty__C (ROM_constStruct.xdc_runtime_Text_nameEmpty__R)
#define ti_sysbios_family_arm_m3_Hwi_Object__count__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_Object__count__R)
#define xdc_runtime_Text_visitRopeFxn__C (ROM_constStruct.xdc_runtime_Text_visitRopeFxn__R)
#define xdc_runtime_SysCallback_abortFxn__C (ROM_constStruct.xdc_runtime_SysCallback_abortFxn__R)
#define ti_sysbios_knl_Task_defaultStackHeap__C (ROM_constStruct.ti_sysbios_knl_Task_defaultStackHeap__R)
#define ti_sysbios_family_arm_m3_Hwi_E_usageFault__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_usageFault__R)
#define ti_sysbios_family_arm_m3_Hwi_ccr__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_ccr__R)
#define ti_sysbios_heaps_HeapTrack_Module__id__C (ROM_constStruct.ti_sysbios_heaps_HeapTrack_Module__id__R)
#define ti_sysbios_heaps_HeapMem_E_memory__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_E_memory__R)
#define ti_sysbios_family_arm_m3_Hwi_E_memFault__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_memFault__R)
#define ti_sysbios_knl_Task_Object__count__C (ROM_constStruct.ti_sysbios_knl_Task_Object__count__R)
#define ti_sysbios_heaps_HeapMem_Object__DESC__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_Object__DESC__R)
#define xdc_runtime_Text_nameUnknown__C (ROM_constStruct.xdc_runtime_Text_nameUnknown__R)
#define xdc_runtime_Memory_defaultHeapInstance__C (ROM_constStruct.xdc_runtime_Memory_defaultHeapInstance__R)
#define ti_sysbios_knl_Mailbox_Instance_State_freeQue__O (ROM_constStruct.ti_sysbios_knl_Mailbox_Instance_State_freeQue__O)
#define xdc_runtime_Startup_sfxnTab__C (ROM_constStruct.xdc_runtime_Startup_sfxnTab__R)
#define ti_sysbios_knl_Clock_Module__state__V (ROM_stateStruct.ti_sysbios_knl_Clock_Module__state__V)
#define ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V (ROM_stateStruct.ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V)
#define xdc_runtime_Startup_Module__state__V (ROM_stateStruct.xdc_runtime_Startup_Module__state__V)
#define xdc_runtime_Registry_Module__state__V (ROM_stateStruct.xdc_runtime_Registry_Module__state__V)
#define ti_sysbios_BIOS_Module__state__V (ROM_stateStruct.ti_sysbios_BIOS_Module__state__V)
#define ti_sysbios_knl_Swi_Module__state__V (ROM_stateStruct.ti_sysbios_knl_Swi_Module__state__V)
#define ti_sysbios_knl_Task_Module__state__V (ROM_stateStruct.ti_sysbios_knl_Task_Module__state__V)
#define xdc_runtime_Memory_Module__state__V (ROM_stateStruct.xdc_runtime_Memory_Module__state__V)
#define xdc_runtime_System_Module__state__V (ROM_stateStruct.xdc_runtime_System_Module__state__V)
#define ti_sysbios_family_arm_m3_Hwi_Module__state__V (ROM_stateStruct.ti_sysbios_family_arm_m3_Hwi_Module__state__V)
#define ti_sysbios_family_arm_cc26xx_Timer_Module__state__V (ROM_stateStruct.ti_sysbios_family_arm_cc26xx_Timer_Module__state__V)

